# BuiltInFailures.FormFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FormFailures Class
BuiltInFailures Class Members See Also
---
Failures about Form.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class FormFailures
```

Visual Basic
---
```text
Public NotInheritable Class FormFailures
```

Visual C++
---
```text
public ref class FormFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..FormFailures
# See Also
BuiltInFailures..::..FormFailures Members
Autodesk.Revit.DB Namespace